[
  {
    "id": 5,
    "name": "To do List - Fullstack",
    "content": "Esta aplicação permite que os usuários gerenciem suas tarefas de maneira eficaz. Ela foi desenvolvida com Express, JWT e TypeORM para o backend, e React.js, Tailwind CSS, Radix UI para o frontend. Banco de dados utilizado foi o PostgreSQL.",
    "imgSrc": "/assets/todolist.png",
    "skills": [
      "React.js",
      "Tailwind",
      "TypeScript",
      "Radix UI",
      "Context API",
      "LocalStorage",
      "TypeORM",
      "Express.js",
      "PostgreSQL",
      "JWT"
    ],
    "deploy": "https://to-do-list-aleexgarcia.vercel.app/",
    "repository": "https://github.com/AleexGarcia/to-do-list"
  },
  {
    "id": 1,
    "name": "AleexGarcia - Portfólio ",
    "content": "Apresento meu site: um portfólio moderno desenvolvido com React.js e TypeScript, estilizado com Chakra UI. Inclui uma página inicial com minha história e uma seção de projetos interativa, destacando minhas habilidades e trabalhos passados. Design responsivo garante acessibilidade em todos os dispositivos. Ideal para compartilhar minha jornada e conquistas no desenvolvimento front-end.",
    "imgSrc": "/assets/Portifolio.jpg",
    "skills": ["TypeScript", "React.js", "Chackra.UI"],
    "deploy": "https://portfolio-aleexgarcia.netlify.app",
    "repository": "https://github.com/AleexGarcia/portifolio"
  },
  {
    "id": 2,
    "name": "Rest Countries API",
    "content": "Minha aplicação React.js com estilo em CSS permite explorar informações de países, exibindo todos na página inicial. Os usuários podem buscar países, filtrar por região e obter detalhes ao clicar em um país. Desenvolvida com chamadas à API, a aplicação é interativa e informativa, destacando minhas habilidades em desenvolvimento web.",
    "imgSrc": "/assets/rest-countries.jpg",
    "skills": ["React.js", "CSS", "JavaScript", "Integração com API"],
    "deploy": "https://restcountries-react-3d18c7.netlify.app",
    "repository": "https://github.com/AleexGarcia/rest-countries-api-react"
  },
  {
    "id": 3,
    "name": "Alura Geek",
    "content": "Ecommerce voltado para produtos geek. Integrei um sistema completo de gerenciamento de Dados para operações CRUD. Além disso, implementei um sistema de registro de usuários com autenticação. Os formulários foram validados. Além disso, se trata de Single Page Application(SPA). Embora recursos avançados como carrinho de compras e segurança mais robusta no armazenamento ainda não estejam presentes, a aplicação proporciona uma base sólida para explorar produtos geek de maneira envolvente.",
    "imgSrc": "/assets/alura-geek.jpg",
    "skills": [
      "React.js",
      "SCSS",
      "JSON Server",
      "LocalStorage",
      "Context API",
      "YUP",
      "React Router Dom",
      "Git"
    ],
    "deploy": "https://aleex-garcia-alura-geek.netlify.app/",
    "repository": "https://github.com/AleexGarcia/Alura-Geek-ReactJS"
  },
  {
    "id": 4,
    "name": "Rock paper scissors",
    "content": "Desenvolvi o clássico jogo Pedra, Papel e Tesoura, utilizando HTML, CSS e JavaScript. O jogo adapta seu layout com base no tamanho da tela do dispositivo, proporcionando uma experiência ideal. Os jogadores enfrentam o computador em partidas emocionantes, registrando os resultados no placar. A pontuação é preservada mesmo após a atualização do navegador, graças ao armazenamento no localStorage. O desafio foi vencido com sucesso ao criar uma divertida e interativa versão do jogo, mantendo o placar ao longo do tempo.",
    "imgSrc": "/assets/rock-paper-scissors.jpg",
    "skills": [
      "HTML",
      "CSS",
      "JavaScript",
      "Responsividade",
      "Manipulação do DOM",
      "LocalStorage"
    ],
    "deploy": "https://aleexgarcia.github.io/rock-paper-scissors",
    "repository": "https://github.com/AleexGarcia/rock-paper-scissors"
  }
]
